---
kind: property
id: P:Autodesk.Revit.DB.CategoryNameMap.IsEmpty
source: html/b2e2f8a8-e106-b326-384b-cc8a936b5cb3.htm
---
# Autodesk.Revit.DB.CategoryNameMap.IsEmpty Property

Test to see if the map is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the map is empty then True will be returned, otherwise False.